DATA SEGMENT
    A DB ? ; оепелеммюъ дкъ упюмемхъ гмювемхъ A
    X DB ? ; оепелеммюъ дкъ упюмемхъ гмювемхъ X
    Y DB ? ; оепелеммюъ дкъ упюмемхъ гмювемхъ Y       
    Y1 DB ?
    Y2 DB ?
    PERENOS DB 13,10,"$" ; яхлбнкш оепебндю ярпнйх (CRLF) х яхлбнк йнмжю ярпнйх дкъ DOS
    VVOD_A DB 13,10,"VVEDITE A=$" ; яннаыемхе опхцкюьемхъ дкъ ббндю A, нйюмвхбючыееяъ

    VVOD_X DB 13,10,"VVEDITE X=$",13,10 ; яннаыемхе опхцкюьемхъ дкъ ббндю X,

    VIVOD_Y DB "Y=$" ; яннаыемхе дкъ бшбндю гмювемхъ Y
ENDS
STACK SEGMENT
    DW 128 DUP(0) ; нопедекемхе ярейю пюглепнл 128 якнб, хмхжхюкхгхпсеряъ мскълх
ENDS
CODE SEGMENT
START:
; сярюмнбйю яецлемрмшу пецхярпнб:
    MOV AX, DATA ; гюцпсгйю яецлемрю дюммшу б AX
    MOV DS, AX ; сярюмнбйю яецлемрю дюммшу
    MOV ES, AX ; сярюмнбйю днонкмхрекэмнцн яецлемрю
    XOR AX, AX ; намскемхе пецхярпю AX
    MOV DX, OFFSET VVOD_A ; гюцпсгйю юдпеяю ярпнйх опхцкюьемхъ дкъ ббндю A б DX
    MOV AH, 9 ; сярюмнбйю тсмйжхх DOS дкъ бшбндю ярпнйх
    INT 21H ; бшгнб DOS дкъ бшбндю ярпнйх
        SLED2:
    MOV AH, 1 ; сярюмнбйю тсмйжхх DOS дкъ ббндю яхлбнкю я йкюбхюрспш
    INT 21H ; бшгнб DOS
    CMP AL, "-" ; опнбепйю, ъбкъеряъ кх ббедеммши яхлбнк гмюйнл лхмсяю
    JNZ SLED1 ; оепеунд, еякх ббедеммши яхлбнк ме лхмся
    MOV BX, 1 ; сярюмнбйю опхгмюйю лхмсяю
    JMP SLED2 ; онбрнпмши ббнд яхлбнкю
        SLED1:
    SUB AL, 30H ; опенапюгнбюмхе ASCII йндю жхтпш б вхякнбне гмювемхе
    TEST BX, BX ; опнбепйю опхгмюйю лхмсяю
    JZ SLED3 ; оепеунд, еякх опхгмюй лхмсяю ме сярюмнбкем
    NEG AL ; хмбепяхъ гмюйю вхякю
    
        SLED3:
    MOV A, AL ; янупюмемхе гмювемхъ A
    XOR AX, AX ; намскемхе пецхярпю AX
    XOR BX, BX ; намскемхе пецхярпю BX
    MOV DX, OFFSET VVOD_X ; гюцпсгйю юдпеяю ярпнйх опхцкюьемхъ дкъ ббндю X б DX
    MOV AH, 9 ; сярюмнбйю тсмйжхх DOS дкъ бшбндю ярпнйх
    INT 21H ; бшгнб DOS дкъ бшбндю ярпнйх
        SLED4:
    MOV AH, 1 ; сярюмнбйю тсмйжхх DOS дкъ ббндю яхлбнкю я йкюбхюрспш
    INT 21H ; бшгнб DOS
    CMP AL, "-" ; опнбепйю, ъбкъеряъ кх ббедеммши яхлбнк гмюйнл лхмсяю
    JNZ SLED5 ; оепеунд, еякх ббедеммши яхлбнк ме лхмся
    MOV BX, 1 ; сярюмнбйю опхгмюйю лхмсяю
    JMP SLED4 ; онбрнпмши ббнд яхлбнкю
        SLED5:
    SUB AL, 30H ; опенапюгнбюмхе ASCII йндю жхтпш б вхякнбне гмювемхе
    TEST BX, BX ; опнбепйю опхгмюйю лхмсяю
    JZ SLED6 ; оепеунд, еякх опхгмюй лхмсяю ме сярюмнбкем
    NEG AL ; хмбепяхъ гмюйю вхякю
        SLED6:
    MOV X, AL ; янупюмемхе гмювемхъ X

    CMP AL, 3 ; япюбмемхе гмювемхи A х X
    JB @LEFT ; оепеунд, еякх A < X
    mov dl, A
    cmp dl, 0
    jb @h
    add dl,al
    mov Y1,dl  
    JMP SHORT @con ; оепеунд й гюбепьемхч
    @h:
    neg dl
    add dl,al
    mov Y1,dl  
    JMP SHORT @con ; оепеунд й гюбепьемхч
        @LEFT:
    ADD al,7h
    mov Y1, al  
    @con:  
    mov ax,0
    mov bx,0
    mov dx,0
    mov bl,X
    cmp bl,5h
    ja @h2
    mov cl,A
    add bl,cl
    mov Y2,bl
    jmp SHORT @VIXOD
    @h2:
    mov Y2, 1
        @VIXOD:     
    mov ax,0
    mov bx,0
    mov al,Y1
    mov bl,Y2
    div bl
    
    
    MOV Y, ah ; янупюмемхе пегскэрюрю б Y
    MOV DX, OFFSET PERENOS ; гюцпсгйю юдпеяю ярпнйх оепебндю ярпнйх б DX
    MOV AH, 9 ; сярюмнбйю тсмйжхх DOS дкъ бшбндю ярпнйх
    INT 21H ; бшгнб DOS дкъ бшбндю ярпнйх
    MOV DX, OFFSET VIVOD_Y ; гюцпсгйю юдпеяю ярпнйх "Y=" б DX
    MOV AH, 9 ; сярюмнбйю тсмйжхх DOS дкъ бшбндю ярпнйх
    INT 21H ; бшгнб DOS дкъ бшбндю ярпнйх
    MOV AL, Y ; гюцпсгйю гмювемхъ Y б AL
    CMP Y, 0 ; опнбепйю гмюйю Y
    JGE SLED7 ; оепеунд, еякх Y >= 0
    NEG AL ; хмбепяхъ гмюйю, еякх Y < 0
    MOV BL, AL ; янупюмемхе онкнфхрекэмнцн гмювемхъ б BL
    MOV DL, "-" ; гюцпсгйю гмюйю лхмсяю б DL
    MOV AH, 2 ; сярюмнбйю тсмйжхх DOS дкъ бшбндю яхлбнкю
    INT 21H ; бшгнб DOS дкъ бшбндю яхлбнкю
    MOV DL, BL ; гюцпсгйю онкнфхрекэмнцн гмювемхъ б DL
    ADD DL, 30H ; опенапюгнбюмхе гмювемхъ б ASCII йнд
    INT 21H ; бшгнб DOS дкъ бшбндю яхлбнкю
    JMP SLED8 ; оепеунд й гюбепьемхч
        SLED7:
    MOV DL, Y ; гюцпсгйю гмювемхъ Y б DL
    ADD DL, 30H ; опенапюгнбюмхе гмювемхъ б ASCII йнд
    MOV AH, 2 ; сярюмнбйю тсмйжхх DOS дкъ бшбндю яхлбнкю
    INT 21H ; бшгнб DOS дкъ бшбндю яхлбнкю
        SLED8:
    MOV DX, OFFSET PERENOS ; гюцпсгйю юдпеяю ярпнйх оепебндю ярпнйх б DX
    MOV AH, 9 ; сярюмнбйю тсмйжхх DOS дкъ бшбндю ярпнйх
    INT 21H ; бшгнб DOS дкъ бшбндю ярпнйх

    MOV AH, 1 ; сярюмнбйю тсмйжхх DOS дкъ нфхдюмхъ мюфюрхъ йкюбхьх
    INT 21H ; бшгнб DOS дкъ нфхдюмхъ мюфюрхъ йкюбхьх
    MOV AX, 4C00H ; сярюмнбйю тсмйжхх DOS дкъ бшундю хг опнцпюллш
    INT 21H ; бшгнб DOS дкъ гюбепьемхъ опнцпюллш
    ENDS
    END START ; сярюмнбйю рнвйх бундю х гюбепьемхе юяяелакхпнбюмхъ